20210821040701-sondages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-22 Mon 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sondages</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Sondages</h1>
<p>
We want to display the latest polls as well as some additional information that should help people undestand the results better. In particular:
</p>
<ul class="org-ul">
<li>Voter turnout (a feature that is often asked);</li>
<li>A reasonable estimation of the error;</li>
<li>The probability to go to 2nd round;</li>
</ul>


<div id="outline-container-org5b6e2ce" class="outline-2">
<h2 id="org5b6e2ce">Estimate the error</h2>
<div class="outline-text-2" id="text-org5b6e2ce">
<p>
We use a Dirichlet-Multinomial model to represent the data generating process. We note \(\vec{p} = (p_1, \dots, p_N)\) the respective probabilities of voting for either of the candidates, \(\vec{\alpha} = (\alpha_1, \dots, \alpha_n)\) the corresponding concentration parameters. The number of votes observed for each candidate is given by:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">align*</span>}
  <span style="font-weight: bold;">\vec</span>{p} <span style="font-weight: bold;">\sim</span> <span style="font-weight: bold;">\operatorname</span>{Dirichlet}(<span style="font-weight: bold;">\vec</span>{<span style="font-weight: bold;">\alpha</span>})
  <span style="font-weight: bold;">\vec</span>{N} <span style="font-weight: bold;">\sim</span> <span style="font-weight: bold;">\operatorname</span>{Multinomial}(<span style="font-weight: bold;">\vec</span>{p}, N_{tot})
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">align*</span>}
</pre>
</div>

<p>
It turns out (surprise!) that the Dirichlet distribution is the conjugate prior of the Multinomial distirbution so that the posterior is also a Dirichlet distribution:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">align*</span>}
  <span style="font-weight: bold;">\vec</span>{p} <span style="font-weight: bold;">\sim</span> <span style="font-weight: bold;">\operatorname</span>{Dirichlet}(<span style="font-weight: bold;">\vec</span>{N} + <span style="font-weight: bold;">\vec</span>{<span style="font-weight: bold;">\alpha</span>})
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">align*</span>}
</pre>
</div>

<p>
We are interested in displaying the marginals, i.e. \(P(p_i|\vec{N})\). If we call \(\alpha_0 = \sum_i \alpha_i\) we can write
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">align*</span>}
  p_i <span style="font-weight: bold;">\sim</span> <span style="font-weight: bold;">\operatorname</span>{Beta}(N_i + <span style="font-weight: bold;">\alpha</span>_i, N_{tot} - N_i + <span style="font-weight: bold;">\alpha</span>_0 -<span style="font-weight: bold;">\alpha</span>_i)
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">align*</span>}
</pre>
</div>

<p>
From which the HDI can be easily computed using eg <a target='_blank' rel='noopener noreferrer' class='external' href="https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.beta.html">scipy</a>.
</p>
</div>

<div id="outline-container-org8e0633c" class="outline-3">
<h3 id="org8e0633c">Choice of prior</h3>
<div class="outline-text-3" id="text-org8e0633c">
<p>
Jeffrey prior is \(\alpha_i = 1/2\), <i>but</i> we do have prior information on the different candidates. We know that Arthaud and Poutou, for instance, are more likely to be between 0 and .05. We also know it is unlikely that anyone will be above .4
</p>

<p>
How do we elicit this prior?
</p>
</div>
</div>
</div>


<div id="outline-container-org474df97" class="outline-2">
<h2 id="org474df97">Estimate the probability that the candidate will go to second tour?</h2>
<div class="outline-text-2" id="text-org474df97">
<p>
Take posterior predictive samples for the \(N_i\). Count the number of times the candidate is in the top 10. Run ~100k simulations (&lt; 1s par sondage).
</p>
</div>
</div>

<div id="outline-container-org551848b" class="outline-2">
<h2 id="org551848b">Links to this note</h2>
</div>
</div>
</body>
</html>
